2020/event-loop-with-coroutine.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2021-03-07 周日 15:57 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>事件循环和协程</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">事件循环和协程</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org211d748">1. 前言</a></li>
<li><a href="#org4153596">2. Python 中异步编程模型的特殊性</a></li>
<li><a href="#orga0fe9bc">3. 协程的基本认识</a></li>
<li><a href="#orgf524bd7">4. 简单事件循环的实现</a></li>
<li><a href="#org54ef34b">5. 简单事件循环的实现 · 修</a></li>
<li><a href="#org3237a17">6. 结语</a></li>
<li><a href="#org9f846ed">7. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org211d748" class="outline-2">
<h2 id="org211d748"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
第一次接触异步编程这个概念是在 <code>Python</code> 里面，去年的时候就因为不清楚 <code>Python</code> 中异步编程的实现原理找了很多资料研究，但最后也没有搞得很清楚。
</p>

<p>
后来又因为重心逐渐转移到了 <code>Java</code> 上，就暂时放弃了对 <code>Python</code> 中异步原理的探究，直到前段时间，被 <code>JavaScript</code> 的异步坑了一次后，让我想起了 <code>Python</code> 里面的异步……
</p>

<p>
然后我就在网上看到了一篇文章，看了半天后在文章的评论中发现了自己两年前的评论……
</p>

<p>
当时我那个心情啊，太曲折了，于是乎决定找个时间在研究一下 <code>Python</code> 中的异步，这便是这篇博客的由来。
</p>

<ul class="org-ul">
<li>注 1：虽然这篇博客源自探究 <code>Python</code> 异步编程实现原理的过程，但是，并不会包含太多 <code>Python</code> 中异步编程的实现原理，因为我还没有搞明白 QAQ</li>
<li>注 2：博客中最后的实现代码存在问题，但一时间找不到解决办法，只好作为一种思路发出来，等待后续研究解决</li>
<li>注 3：哇咔咔咔，通过研究 JavaScript 的异步实现解决了代码的问题 (≧▽≦)/</li>
</ul>
</div>
</div>

<div id="outline-container-org4153596" class="outline-2">
<h2 id="org4153596"><span class="section-number-2">2</span> Python 中异步编程模型的特殊性</h2>
<div class="outline-text-2" id="text-2">
<p>
我先后接触过了 Python、JavaScript<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> 和 Java 中的异步编程，其中，Python 的是最为特殊的一个，因为它是 <b>单线程</b> 和 <b>异步阻塞</b> 的。
</p>

<p>
通常来说，异步编程模型下最小的执行单位是一个个任务（往往就是一个函数），而为了能够在一个任务执行完成后执行另外的操作，又会引入回调任务（函数）。不同的任务和回调任务的执行，往往又是通过事件循环和任务队列来完成。
</p>

<p>
假如将这些东西拆分开来，像 JavaScript 那样，放在不同的线程下面处理，是很容易理解的，因为整体结构足够清晰，但是 Python 不行，因为 <code>GIL</code> 的原因，如果 Python 还是使用多线程的方式来实现异步编程的话，并不能带来多少性能上的提升，因此，Python 异步中的事件循环、任务队列和任务的执行都在一个线程里面。
</p>

<p>
而且，Python 中异步的实现是基于协程的，这不仅使得 Python 中的异步是阻塞的，而且，最小执行单位不再是单个任务，而是单个任务的一部分。
</p>

<p>
这就让 Python 中异步的实现变得复杂起来，本来 Python 的源码就不好读，好家伙，现在更不好读了，同时又因为异步编程往往都和异步 I/O 挂钩，刷的一下，源码中一堆和异步 I/O 相关的代码……
</p>

<p>
这让我明白了，想快速搞明白 Python 异步是咋回事是不可能的，毕竟，我要做的是通过阅读源码倒推作者的思路，这很难！！！
</p>

<p>
因此，我换了一个思路，我先自己用协程实现一个简单的事件循环，在慢慢去读 Python 的源码，总可以了吧！
</p>

<p>
这就是为啥这篇博客说是在探究 <code>Python</code> 异步编程的实现原理，但是标题连 Python 这个单词都没有的原因。
</p>
</div>
</div>

<div id="outline-container-orga0fe9bc" class="outline-2">
<h2 id="orga0fe9bc"><span class="section-number-2">3</span> 协程的基本认识</h2>
<div class="outline-text-2" id="text-3">
<p>
Python 中的协程是通过生成器来实现的，但是，基本上所有博客将协程的时候都会说的一句话，协程不等于生成器，它们只是长得像：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">grep</span>(pattern):
    <span class="org-doc">"""</span>
<span class="org-doc">    &gt;&gt;&gt; g = grep("python")</span>
<span class="org-doc">    &gt;&gt;&gt; g.send(None)</span>
<span class="org-doc">    Looking for python</span>
<span class="org-doc">    &gt;&gt;&gt; g.send("Yeah, but no, but yeah, but no")</span>
<span class="org-doc">    &gt;&gt;&gt; g.send("A series of tubes")</span>
<span class="org-doc">    &gt;&gt;&gt; g.send("python generators rock!")</span>
<span class="org-doc">    python generators rock!</span>
<span class="org-doc">    """</span>
    <span class="org-keyword">print</span>(<span class="org-string">"Looking for %s"</span> % pattern)
    <span class="org-keyword">while</span> <span class="org-constant">True</span>:
        <span class="org-variable-name">line</span> = <span class="org-keyword">yield</span>
        <span class="org-keyword">if</span> pattern <span class="org-keyword">in</span> line:
            <span class="org-keyword">print</span>(line)
</pre>
</div>

<p>
上面这个协程不断接收来自 <code>send</code> 方法的输入，在经过判断后进行输出，假如把它当做生成器使用的话，那么你只能得到无数的 <code>None</code> 值。
</p>

<p>
本质上，在低版本的 <code>Python</code> 中生成器和协程没有区别，就看你怎么用，关键就在于协程 <b>消费</b> 值，而生成器 <b>生成</b> 值，当然了，高版本的 <code>Python</code> 对协程提供了更多的支持，使得它们不再一样，但是，这篇博客里面，所有的协程都通过生成器实现。
</p>

<p>
因此，我们需要关注后面会用到的几个特性：
</p>
<ol class="org-ol">
<li><p>
<code>yield</code> 的左值会接收来自 <code>send</code> 方法的输入，但是协程在第一次运行时还没到达 <code>yield</code> 语句处，因此无法传递参数，只能通过 <code>None</code> 值来调用协程：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">coroutine</span>():
    <span class="org-keyword">while</span> <span class="org-constant">True</span>:
        <span class="org-variable-name">val</span> = <span class="org-keyword">yield</span>
        <span class="org-keyword">print</span>(val)
</pre>
</div>

<p>
执行输出：
</p>
<pre class="example">
In [9]: coro = coroutine()

In [10]: coro.send(None)

In [11]: coro.send(1)
1

In [12]: coro = coroutine()

In [13]: coro.send(1)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
&lt;ipython-input-13-e272bd1527da&gt; in &lt;module&gt;()
----&gt; 1 coro.send(1)

TypeError: can't send non-None value to a just-started generator
</pre></li>

<li><p>
可以通过 <code>yield from</code> 语句递归调用协程，效果如下：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">coroutine</span>():
    <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(3):
        <span class="org-variable-name">val</span> = <span class="org-keyword">yield</span>
        <span class="org-keyword">print</span>(<span class="org-string">'coroutine %s'</span> % val)

<span class="org-keyword">def</span> <span class="org-function-name">invoker</span>():
    <span class="org-keyword">yield</span> <span class="org-keyword">from</span> coroutine()
</pre>
</div>

<p>
执行输出（就是会报异常）：
</p>
<pre class="example">
In [29]: coro = invoker()

In [30]: coro.send(None)

In [31]: coro.send(1)
coroutine 1

In [32]: coro.send(2)
coroutine 2

In [33]: coro.send(3)
coroutine 3
---------------------------------------------------------------------------
StopIteration                             Traceback (most recent call last)
&lt;ipython-input-33-8e657389bc11&gt; in &lt;module&gt;()
----&gt; 1 coro.send(3)

StopIteration:
</pre></li>

<li><p>
协程可以有返回值，保存在 <code>StopIteration</code> 异常中，作为 <code>yield from</code> 的左值时可以直接接收：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">coroutine</span>():
    <span class="org-variable-name">val</span> = <span class="org-keyword">yield</span>
    <span class="org-keyword">return</span> <span class="org-string">'coroutine %s'</span> % val
</pre>
</div>

<p>
执行输出：
</p>
<pre class="example">
In [42]: coro = coroutine()

In [43]: coro.send(None)

In [44]: coro.send(1)
---------------------------------------------------------------------------
StopIteration                             Traceback (most recent call last)
&lt;ipython-input-44-e272bd1527da&gt; in &lt;module&gt;()
----&gt; 1 coro.send(1)

StopIteration: coroutine 1
</pre></li>
</ol>
</div>
</div>
