2020/event-loop-with-coroutine.org
* 简单事件循环的实现     
  本来想将 ~Future & Task~ 和 ~EventLoop~ 分成两节的，结果 ~Task~ 和 ~EventLoop~ 耦合在了一起，只好合在一起了，下面是代码：
  #+BEGIN_SRC python
    class EventLoop:
        def __init__(self):
            self._ready = []

        def call_soon(self, task):
            self._ready.append(task)

        def run_forever(self, coro):
            root = Task(coro, self)
            while self._ready:
                task = self._ready.pop(0)
                task.step(Future())
            return root.result

    class Future:
        def __init__(self):
            # 通过 result 来保存协程的返回值
            self.result = None
            # 通过 _callbacks 来保存回调函数
            self._callbacks = []

        def add_done_callback(self, fn):
            self._callbacks.append(fn)

        def set_result(self, result):
            # try suppression bug
            self.result = self.result or result
            # 执行完成后将自身作为参数传递给回调函数
            for callback in self._callbacks:
                callback(self)

    class Task(Future):
        # 协程类型
        coroutine = type((i for i in range(0)))

        def __init__(self, coro, loop):
            super().__init__()
            self.coro = coro
            self.loop = loop
            # 将自身加入任务队列
            self.loop.call_soon(self)

        def step(self, future):
            try:
                result = self.coro.send(future.result)
            except StopIteration as exc:
                # 触发 StopIteration 异常时说明协程已经执行结束
                self.set_result(exc.value)
            else:
                # 协程返回协程，将其转换为 Task 后将 self.step 注册为期回调函数等待唤醒
                if type(result) == self.coroutine:
                    result = Task(result, self.loop)
                    result.add_done_callback(self.step)
                # 协程返回任务，将 self.step 注册为回调函数等待唤醒
                elif isinstance(result, Task):
                    # there is a bug
                    result.add_done_callback(self.step)
                    self.loop.call_soon(result)
                # 协程返回其他东西，不受理，直接将 self 再次放入任务队列
                else:
                    self.loop.call_soon(self)
  #+END_SRC

  一开始实现的时候是想用一个外部的事件循环来操作，不需要 ~Task~ 持有事件循环，但是实现过程中发现那样存在一点问题，便学着 ~Python~ 中的方式将事件循环传递给 ~Task~ 操作，
  但这里的实现是依然存在问题。
  
  在只存在协程和同序返回 ~Task~ 的情况下测试没有问题，但是当存在异序返回 ~Task~ 的情况下问题就出现了，下面的测试代码便是异序返回，我通过在 ~set_result~ 中判断 ~result~ 的方式暂时抑制了该异常，
  但是，这是治标不治本的方式。如果有大佬知道方案，请务必告诉我 QAQ

  测试代码：
  #+BEGIN_SRC python
    _loop = EventLoop()

    def main():
        ta = Task(say_hello(), _loop)
        tb = Task(say_world(), _loop)

        b = yield tb
        a = yield ta

        return a + b

    def say_world():
        print('world')
        yield
        return 'world'

    def say_hello():
        print('hello')
        yield from say_other()
        return 'hello '


    def say_other():
        print('other')
        yield

    print(_loop.run_forever(main()))
  #+END_SRC

  输出：
  #+BEGIN_EXAMPLE
    hello
    other
    world
    hello world
  #+END_EXAMPLE

