2020/event-loop-with-coroutine.html

<div id="outline-container-orgf524bd7" class="outline-2">
<h2 id="orgf524bd7"><span class="section-number-2">4</span> 简单事件循环的实现</h2>
<div class="outline-text-2" id="text-4">
<p>
本来想将 <code>Future &amp; Task</code> 和 <code>EventLoop</code> 分成两节的，结果 <code>Task</code> 和 <code>EventLoop</code> 耦合在了一起，只好合在一起了，下面是代码：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">EventLoop</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">self</span>._ready = []

    <span class="org-keyword">def</span> <span class="org-function-name">call_soon</span>(<span class="org-keyword">self</span>, task):
        <span class="org-keyword">self</span>._ready.append(task)

    <span class="org-keyword">def</span> <span class="org-function-name">run_forever</span>(<span class="org-keyword">self</span>, coro):
        <span class="org-variable-name">root</span> = Task(coro, <span class="org-keyword">self</span>)
        <span class="org-keyword">while</span> <span class="org-keyword">self</span>._ready:
            <span class="org-variable-name">task</span> = <span class="org-keyword">self</span>._ready.pop(0)
            task.step(Future())
        <span class="org-keyword">return</span> root.result

<span class="org-keyword">class</span> <span class="org-type">Future</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-comment-delimiter"># </span><span class="org-comment">&#36890;&#36807; result &#26469;&#20445;&#23384;&#21327;&#31243;&#30340;&#36820;&#22238;&#20540;</span>
        <span class="org-keyword">self</span>.result = <span class="org-constant">None</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">&#36890;&#36807; _callbacks &#26469;&#20445;&#23384;&#22238;&#35843;&#20989;&#25968;</span>
        <span class="org-keyword">self</span>._callbacks = []

    <span class="org-keyword">def</span> <span class="org-function-name">add_done_callback</span>(<span class="org-keyword">self</span>, fn):
        <span class="org-keyword">self</span>._callbacks.append(fn)

    <span class="org-keyword">def</span> <span class="org-function-name">set_result</span>(<span class="org-keyword">self</span>, result):
        <span class="org-comment-delimiter"># </span><span class="org-comment">try suppression bug</span>
        <span class="org-keyword">self</span>.result = <span class="org-keyword">self</span>.result <span class="org-keyword">or</span> result
        <span class="org-comment-delimiter"># </span><span class="org-comment">&#25191;&#34892;&#23436;&#25104;&#21518;&#23558;&#33258;&#36523;&#20316;&#20026;&#21442;&#25968;&#20256;&#36882;&#32473;&#22238;&#35843;&#20989;&#25968;</span>
        <span class="org-keyword">for</span> callback <span class="org-keyword">in</span> <span class="org-keyword">self</span>._callbacks:
            callback(<span class="org-keyword">self</span>)

<span class="org-keyword">class</span> <span class="org-type">Task</span>(Future):
    <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#31867;&#22411;</span>
    <span class="org-variable-name">coroutine</span> = <span class="org-builtin">type</span>((i <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(0)))

    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, coro, loop):
        <span class="org-builtin">super</span>().__init__()
        <span class="org-keyword">self</span>.coro = coro
        <span class="org-keyword">self</span>.loop = loop
        <span class="org-comment-delimiter"># </span><span class="org-comment">&#23558;&#33258;&#36523;&#21152;&#20837;&#20219;&#21153;&#38431;&#21015;</span>
        <span class="org-keyword">self</span>.loop.call_soon(<span class="org-keyword">self</span>)

    <span class="org-keyword">def</span> <span class="org-function-name">step</span>(<span class="org-keyword">self</span>, future):
        <span class="org-keyword">try</span>:
            <span class="org-variable-name">result</span> = <span class="org-keyword">self</span>.coro.send(future.result)
        <span class="org-keyword">except</span> <span class="org-type">StopIteration</span> <span class="org-keyword">as</span> exc:
            <span class="org-comment-delimiter"># </span><span class="org-comment">&#35302;&#21457; StopIteration &#24322;&#24120;&#26102;&#35828;&#26126;&#21327;&#31243;&#24050;&#32463;&#25191;&#34892;&#32467;&#26463;</span>
            <span class="org-keyword">self</span>.set_result(exc.value)
        <span class="org-keyword">else</span>:
            <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#36820;&#22238;&#21327;&#31243;&#65292;&#23558;&#20854;&#36716;&#25442;&#20026; Task &#21518;&#23558; self.step &#27880;&#20876;&#20026;&#26399;&#22238;&#35843;&#20989;&#25968;&#31561;&#24453;&#21796;&#37266;</span>
            <span class="org-keyword">if</span> <span class="org-builtin">type</span>(result) == <span class="org-keyword">self</span>.coroutine:
                <span class="org-variable-name">result</span> = Task(result, <span class="org-keyword">self</span>.loop)
                result.add_done_callback(<span class="org-keyword">self</span>.step)
            <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#36820;&#22238;&#20219;&#21153;&#65292;&#23558; self.step &#27880;&#20876;&#20026;&#22238;&#35843;&#20989;&#25968;&#31561;&#24453;&#21796;&#37266;</span>
            <span class="org-keyword">elif</span> <span class="org-builtin">isinstance</span>(result, Task):
                <span class="org-comment-delimiter"># </span><span class="org-comment">there is a bug</span>
                result.add_done_callback(<span class="org-keyword">self</span>.step)
                <span class="org-keyword">self</span>.loop.call_soon(result)
            <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#36820;&#22238;&#20854;&#20182;&#19996;&#35199;&#65292;&#19981;&#21463;&#29702;&#65292;&#30452;&#25509;&#23558; self &#20877;&#27425;&#25918;&#20837;&#20219;&#21153;&#38431;&#21015;</span>
            <span class="org-keyword">else</span>:
                <span class="org-keyword">self</span>.loop.call_soon(<span class="org-keyword">self</span>)
</pre>
</div>

<p>
一开始实现的时候是想用一个外部的事件循环来操作，不需要 <code>Task</code> 持有事件循环，但是实现过程中发现那样存在一点问题，便学着 <code>Python</code> 中的方式将事件循环传递给 <code>Task</code> 操作，但这里的实现是依然存在问题。
</p>

<p>
在只存在协程和同序返回 <code>Task</code> 的情况下测试没有问题，但是当存在异序返回 <code>Task</code> 的情况下问题就出现了，下面的测试代码便是异序返回，我通过在 <code>set_result</code> 中判断 <code>result</code> 的方式暂时抑制了该异常，但是，这是治标不治本的方式。如果有大佬知道方案，请务必告诉我 QAQ
</p>

<p>
测试代码：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">_loop</span> = EventLoop()

<span class="org-keyword">def</span> <span class="org-function-name">main</span>():
    <span class="org-variable-name">ta</span> = Task(say_hello(), _loop)
    <span class="org-variable-name">tb</span> = Task(say_world(), _loop)

    <span class="org-variable-name">b</span> = <span class="org-keyword">yield</span> tb
    <span class="org-variable-name">a</span> = <span class="org-keyword">yield</span> ta

    <span class="org-keyword">return</span> a + b

<span class="org-keyword">def</span> <span class="org-function-name">say_world</span>():
    <span class="org-keyword">print</span>(<span class="org-string">'world'</span>)
    <span class="org-keyword">yield</span>
    <span class="org-keyword">return</span> <span class="org-string">'world'</span>

<span class="org-keyword">def</span> <span class="org-function-name">say_hello</span>():
    <span class="org-keyword">print</span>(<span class="org-string">'hello'</span>)
    <span class="org-keyword">yield</span> <span class="org-keyword">from</span> say_other()
    <span class="org-keyword">return</span> <span class="org-string">'hello '</span>


<span class="org-keyword">def</span> <span class="org-function-name">say_other</span>():
    <span class="org-keyword">print</span>(<span class="org-string">'other'</span>)
    <span class="org-keyword">yield</span>

<span class="org-keyword">print</span>(_loop.run_forever(main()))
</pre>
</div>

<p>
输出：
</p>
<pre class="example">
hello
other
world
hello world
</pre>
</div>
</div>
