2020/event-loop-with-coroutine.org
* 简单事件循环的实现 · 修
  发现在 ~Python~ 这边碰壁后，我就想到了去 ~JavaScript~ 这边取取经，然后，我就在阮老师的 [[https://es6.ruanyifeng.com/#docs/generator-async][Generator 函数的异步应用]] 教程里面找到了自己代码的问题，并成功解决  (≧▽≦)/
  
  这是新的代码：
  #+begin_src python
    class EventLoop:
        def __init__(self):
            self._ready = []

        def call_soon(self, task):
            self._ready.append(task)

        def run_forever(self, coro):
            root = Task(coro, self)
            while self._ready:
                task = self._ready.pop(0)
                task.step(Future())
            return root.result


    class Future:
        def __init__(self):
            # 自身是否执行完成
            self.done = False
            # 通过 result 来保存协程的返回值
            self.result = None
            # 通过 _callbacks 来保存回调函数
            self._callbacks = []

        def add_done_callback(self, callback):
            if not self.done:
                self._callbacks.append(callback)
            else:
                callback(self)

        def set_result(self, result):
            self.result = result
            self.done = True
            # 执行完成后将自身作为参数传递给回调函数
            for callback in self._callbacks:
                callback(self)

    class Task(Future):
        # 协程类型
        coroutine = type((i for i in range(0)))

        def __init__(self, coro, loop):
            super().__init__()
            self.coro = coro
            self.loop = loop
            # 将自身加入任务队列
            self.loop.call_soon(self)

        def step(self, future):
            try:
                result = self.coro.send(future.result)
            except StopIteration as exc:
                # 触发 StopIteration 异常时说明协程已经执行结束
                self.set_result(exc.value)
            else:
                # 协程返回协程，将其转换为 Task
                if type(result) == self.coroutine:
                    result = Task(result, self.loop)
                # 将 self.step 注册为 task 回调函数等待唤醒
                if isinstance(result, Task):
                    result.add_done_callback(self.step)
                # 协程返回其他东西，不受理，直接将 self 再次放入任务队列
                else:
                    self.loop.call_soon(self)
  #+end_src
  
  主要改动为：
  #+begin_src python
     class Future:
         def __init__(self):
    +        # 自身是否执行完成
    +        self.done = False
             # 通过 result 来保存协程的返回值
             self.result = None
             # 通过 _callbacks 来保存回调函数
             self._callbacks = []

    -    def add_done_callback(self, fn):
    -        self._callbacks.append(fn)
    +    def add_done_callback(self, callback):
    +        if not self.done:
    +            self._callbacks.append(callback)
    +        else:
    +            callback(self)

         def set_result(self, result):
    -        # try suppression bug
    -        self.result = self.result or result
    +        self.result = result
    +        self.done = True
             # 执行完成后将自身作为参数传递给回调函数
             for callback in self._callbacks:
                 callback(self)
    @@ -47,15 +53,12 @@
                 # 触发 StopIteration 异常时说明协程已经执行结束
                 self.set_result(exc.value)
             else:
    -            # 协程返回协程，将其转换为 Task 后将 self.step 注册为期回调函数等待唤醒
    +            # 协程返回协程，将其转换为 Task
                 if type(result) == self.coroutine:
                     result = Task(result, self.loop)
    +            # 将 self.step 注册为 task 回调函数等待唤醒
    +            if isinstance(result, Task):
                     result.add_done_callback(self.step)
    -            # 协程返回任务，将 self.step 注册为回调函数等待唤醒
    -            elif isinstance(result, Task):
    -                # there is a bug
    -                result.add_done_callback(self.step)
    -                self.loop.call_soon(result)
                 # 协程返回其他东西，不受理，直接将 self 再次放入任务队列
                 else:
                     self.loop.call_soon(self)
  #+end_src

  问题原因为：
  1. 创建 Task 时任务会被立即加入事件循环，在任务执行时发现返回的是一个 Task 那么就会将唤醒自身的回调注册到该任务的回调函数中
  2. 如果这时任务已经执行完成了，那么，按照我之前的逻辑，这次回调函数的注册是无效的
  3. 结果就是，我发现回调函数没有执行，就只好在注册了回调函数后仍然将自身加入事件循环，导致重复调用

  现在好了，加个判断，加入注册回调函数时自身已经执行完成了，就立即执行回调函数，这样就不用担心出现问题了。

  优化：
  1. 现在的执行模式的话可能导致递归调用，更好的方式就是改造一下，在注册回调函数时发现自身已经执行完成，那么就把回调函数封装为 Task 注册到事件循环
  2. 现在的事件循环其实就只是个简单的同步协程执行器，而异步操作关注的更多的往往是 ~I/O~ 操作，因此可以考虑通过 ~Selector~ 的方式注册异步 I/O 回调函数，
     这个到时候可以去研究一下 Python 里面的实现

