2020/event-loop-with-coroutine.html

<div id="outline-container-org54ef34b" class="outline-2">
<h2 id="org54ef34b"><span class="section-number-2">5</span> 简单事件循环的实现 · 修</h2>
<div class="outline-text-2" id="text-5">
<p>
发现在 <code>Python</code> 这边碰壁后，我就想到了去 <code>JavaScript</code> 这边取取经，然后，我就在阮老师的 <a href="https://es6.ruanyifeng.com/#docs/generator-async">Generator 函数的异步应用</a> 教程里面找到了自己代码的问题，并成功解决  (≧▽≦)/
</p>

<p>
这是新的代码：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">EventLoop</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">self</span>._ready = []

    <span class="org-keyword">def</span> <span class="org-function-name">call_soon</span>(<span class="org-keyword">self</span>, task):
        <span class="org-keyword">self</span>._ready.append(task)

    <span class="org-keyword">def</span> <span class="org-function-name">run_forever</span>(<span class="org-keyword">self</span>, coro):
        <span class="org-variable-name">root</span> = Task(coro, <span class="org-keyword">self</span>)
        <span class="org-keyword">while</span> <span class="org-keyword">self</span>._ready:
            <span class="org-variable-name">task</span> = <span class="org-keyword">self</span>._ready.pop(0)
            task.step(Future())
        <span class="org-keyword">return</span> root.result


<span class="org-keyword">class</span> <span class="org-type">Future</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-comment-delimiter"># </span><span class="org-comment">&#33258;&#36523;&#26159;&#21542;&#25191;&#34892;&#23436;&#25104;</span>
        <span class="org-keyword">self</span>.done = <span class="org-constant">False</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">&#36890;&#36807; result &#26469;&#20445;&#23384;&#21327;&#31243;&#30340;&#36820;&#22238;&#20540;</span>
        <span class="org-keyword">self</span>.result = <span class="org-constant">None</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">&#36890;&#36807; _callbacks &#26469;&#20445;&#23384;&#22238;&#35843;&#20989;&#25968;</span>
        <span class="org-keyword">self</span>._callbacks = []

    <span class="org-keyword">def</span> <span class="org-function-name">add_done_callback</span>(<span class="org-keyword">self</span>, callback):
        <span class="org-keyword">if</span> <span class="org-keyword">not</span> <span class="org-keyword">self</span>.done:
            <span class="org-keyword">self</span>._callbacks.append(callback)
        <span class="org-keyword">else</span>:
            callback(<span class="org-keyword">self</span>)

    <span class="org-keyword">def</span> <span class="org-function-name">set_result</span>(<span class="org-keyword">self</span>, result):
        <span class="org-keyword">self</span>.result = result
        <span class="org-keyword">self</span>.done = <span class="org-constant">True</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">&#25191;&#34892;&#23436;&#25104;&#21518;&#23558;&#33258;&#36523;&#20316;&#20026;&#21442;&#25968;&#20256;&#36882;&#32473;&#22238;&#35843;&#20989;&#25968;</span>
        <span class="org-keyword">for</span> callback <span class="org-keyword">in</span> <span class="org-keyword">self</span>._callbacks:
            callback(<span class="org-keyword">self</span>)

<span class="org-keyword">class</span> <span class="org-type">Task</span>(Future):
    <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#31867;&#22411;</span>
    <span class="org-variable-name">coroutine</span> = <span class="org-builtin">type</span>((i <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(0)))

    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, coro, loop):
        <span class="org-builtin">super</span>().__init__()
        <span class="org-keyword">self</span>.coro = coro
        <span class="org-keyword">self</span>.loop = loop
        <span class="org-comment-delimiter"># </span><span class="org-comment">&#23558;&#33258;&#36523;&#21152;&#20837;&#20219;&#21153;&#38431;&#21015;</span>
        <span class="org-keyword">self</span>.loop.call_soon(<span class="org-keyword">self</span>)

    <span class="org-keyword">def</span> <span class="org-function-name">step</span>(<span class="org-keyword">self</span>, future):
        <span class="org-keyword">try</span>:
            <span class="org-variable-name">result</span> = <span class="org-keyword">self</span>.coro.send(future.result)
        <span class="org-keyword">except</span> <span class="org-type">StopIteration</span> <span class="org-keyword">as</span> exc:
            <span class="org-comment-delimiter"># </span><span class="org-comment">&#35302;&#21457; StopIteration &#24322;&#24120;&#26102;&#35828;&#26126;&#21327;&#31243;&#24050;&#32463;&#25191;&#34892;&#32467;&#26463;</span>
            <span class="org-keyword">self</span>.set_result(exc.value)
        <span class="org-keyword">else</span>:
            <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#36820;&#22238;&#21327;&#31243;&#65292;&#23558;&#20854;&#36716;&#25442;&#20026; Task</span>
            <span class="org-keyword">if</span> <span class="org-builtin">type</span>(result) == <span class="org-keyword">self</span>.coroutine:
                <span class="org-variable-name">result</span> = Task(result, <span class="org-keyword">self</span>.loop)
            <span class="org-comment-delimiter"># </span><span class="org-comment">&#23558; self.step &#27880;&#20876;&#20026; task &#22238;&#35843;&#20989;&#25968;&#31561;&#24453;&#21796;&#37266;</span>
            <span class="org-keyword">if</span> <span class="org-builtin">isinstance</span>(result, Task):
                result.add_done_callback(<span class="org-keyword">self</span>.step)
            <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#36820;&#22238;&#20854;&#20182;&#19996;&#35199;&#65292;&#19981;&#21463;&#29702;&#65292;&#30452;&#25509;&#23558; self &#20877;&#27425;&#25918;&#20837;&#20219;&#21153;&#38431;&#21015;</span>
            <span class="org-keyword">else</span>:
                <span class="org-keyword">self</span>.loop.call_soon(<span class="org-keyword">self</span>)
</pre>
</div>

<p>
主要改动为：
</p>
<div class="org-src-container">
<pre class="src src-python"> <span class="org-keyword">class</span> <span class="org-type">Future</span>:
     <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
+        <span class="org-comment-delimiter"># </span><span class="org-comment">&#33258;&#36523;&#26159;&#21542;&#25191;&#34892;&#23436;&#25104;</span>
+        <span class="org-keyword">self</span>.done = <span class="org-constant">False</span>
         <span class="org-comment-delimiter"># </span><span class="org-comment">&#36890;&#36807; result &#26469;&#20445;&#23384;&#21327;&#31243;&#30340;&#36820;&#22238;&#20540;</span>
         <span class="org-keyword">self</span>.result = <span class="org-constant">None</span>
         <span class="org-comment-delimiter"># </span><span class="org-comment">&#36890;&#36807; _callbacks &#26469;&#20445;&#23384;&#22238;&#35843;&#20989;&#25968;</span>
         <span class="org-keyword">self</span>._callbacks = []

-    <span class="org-keyword">def</span> <span class="org-function-name">add_done_callback</span>(<span class="org-keyword">self</span>, fn):
-        <span class="org-keyword">self</span>._callbacks.append(fn)
+    <span class="org-keyword">def</span> <span class="org-function-name">add_done_callback</span>(<span class="org-keyword">self</span>, callback):
+        <span class="org-keyword">if</span> <span class="org-keyword">not</span> <span class="org-keyword">self</span>.done:
+            <span class="org-keyword">self</span>._callbacks.append(callback)
+        <span class="org-keyword">else</span>:
+            callback(<span class="org-keyword">self</span>)

     <span class="org-keyword">def</span> <span class="org-function-name">set_result</span>(<span class="org-keyword">self</span>, result):
-        <span class="org-comment-delimiter"># </span><span class="org-comment">try suppression bug</span>
-        <span class="org-keyword">self</span>.result = <span class="org-keyword">self</span>.result <span class="org-keyword">or</span> result
+        <span class="org-keyword">self</span>.result = result
+        <span class="org-keyword">self</span>.done = <span class="org-constant">True</span>
         <span class="org-comment-delimiter"># </span><span class="org-comment">&#25191;&#34892;&#23436;&#25104;&#21518;&#23558;&#33258;&#36523;&#20316;&#20026;&#21442;&#25968;&#20256;&#36882;&#32473;&#22238;&#35843;&#20989;&#25968;</span>
         <span class="org-keyword">for</span> callback <span class="org-keyword">in</span> <span class="org-keyword">self</span>._callbacks:
             callback(<span class="org-keyword">self</span>)
@@ -47,15 +53,12 @@
             <span class="org-comment-delimiter"># </span><span class="org-comment">&#35302;&#21457; StopIteration &#24322;&#24120;&#26102;&#35828;&#26126;&#21327;&#31243;&#24050;&#32463;&#25191;&#34892;&#32467;&#26463;</span>
             <span class="org-keyword">self</span>.set_result(exc.value)
         <span class="org-keyword">else</span>:
-            <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#36820;&#22238;&#21327;&#31243;&#65292;&#23558;&#20854;&#36716;&#25442;&#20026; Task &#21518;&#23558; self.step &#27880;&#20876;&#20026;&#26399;&#22238;&#35843;&#20989;&#25968;&#31561;&#24453;&#21796;&#37266;</span>
+            <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#36820;&#22238;&#21327;&#31243;&#65292;&#23558;&#20854;&#36716;&#25442;&#20026; Task</span>
             <span class="org-keyword">if</span> <span class="org-builtin">type</span>(result) == <span class="org-keyword">self</span>.coroutine:
                 <span class="org-variable-name">result</span> = Task(result, <span class="org-keyword">self</span>.loop)
+            <span class="org-comment-delimiter"># </span><span class="org-comment">&#23558; self.step &#27880;&#20876;&#20026; task &#22238;&#35843;&#20989;&#25968;&#31561;&#24453;&#21796;&#37266;</span>
+            <span class="org-keyword">if</span> <span class="org-builtin">isinstance</span>(result, Task):
                 result.add_done_callback(<span class="org-keyword">self</span>.step)
-            <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#36820;&#22238;&#20219;&#21153;&#65292;&#23558; self.step &#27880;&#20876;&#20026;&#22238;&#35843;&#20989;&#25968;&#31561;&#24453;&#21796;&#37266;</span>
-            <span class="org-keyword">elif</span> <span class="org-builtin">isinstance</span>(result, Task):
-                <span class="org-comment-delimiter"># </span><span class="org-comment">there is a bug</span>
-                result.add_done_callback(<span class="org-keyword">self</span>.step)
-                <span class="org-keyword">self</span>.loop.call_soon(result)
             <span class="org-comment-delimiter"># </span><span class="org-comment">&#21327;&#31243;&#36820;&#22238;&#20854;&#20182;&#19996;&#35199;&#65292;&#19981;&#21463;&#29702;&#65292;&#30452;&#25509;&#23558; self &#20877;&#27425;&#25918;&#20837;&#20219;&#21153;&#38431;&#21015;</span>
             <span class="org-keyword">else</span>:
                 <span class="org-keyword">self</span>.loop.call_soon(<span class="org-keyword">self</span>)
</pre>
</div>

<p>
问题原因为：
</p>
<ol class="org-ol">
<li>创建 Task 时任务会被立即加入事件循环，在任务执行时发现返回的是一个 Task 那么就会将唤醒自身的回调注册到该任务的回调函数中</li>
<li>如果这时任务已经执行完成了，那么，按照我之前的逻辑，这次回调函数的注册是无效的</li>
<li>结果就是，我发现回调函数没有执行，就只好在注册了回调函数后仍然将自身加入事件循环，导致重复调用</li>
</ol>

<p>
现在好了，加个判断，加入注册回调函数时自身已经执行完成了，就立即执行回调函数，这样就不用担心出现问题了。
</p>

<p>
优化：
</p>
<ol class="org-ol">
<li>现在的执行模式的话可能导致递归调用，更好的方式就是改造一下，在注册回调函数时发现自身已经执行完成，那么就把回调函数封装为 Task 注册到事件循环</li>
<li>现在的事件循环其实就只是个简单的同步协程执行器，而异步操作关注的更多的往往是 <code>I/O</code> 操作，因此可以考虑通过 <code>Selector</code> 的方式注册异步 I/O 回调函数，这个到时候可以去研究一下 Python 里面的实现</li>
</ol>
</div>
</div>
